{
    "titre": "Zombies Garous",
    "description": "Un site de jeu en ligne <span class='Important-Word SecondaryColor'>revisitant</span> le concept des Loups-Garous avec des zombies.",
    "introduction": "Ce site est un projet d'étude réalisé avec <span class='Important-Word PrimaryColor'>deux autres personnes.</span> L'objectif était de créer une version <span class='Important-Word PrimaryColor'>revisitée</span> du jeu Loups-Garous, avec des zombies, jouable en <span class='Important-Word PrimaryColor'>ligne.</span>",
    "technologies": "Pour les technologies de ce projet, nous avons utilisé <span class='Important-Word PrimaryColor'>Next.js</span> pour le frontend et une API <span class='Important-Word PrimaryColor'>Express</span> pour le backend. <span class='Important-Word PrimaryColor'>Prisma, PostgreSQL et Docker</span> ont été employés pour la gestion de la base de données, tandis que <span class='Important-Word PrimaryColor'>Tailwind CSS</span> a servi pour le design. Nous avons utilisé <span class='Important-Word PrimaryColor'>Firebase</span> pour la gestion des utilisateurs et <span class='Important-Word PrimaryColor'>Socket.IO</span> pour synchroniser les joueurs et les différentes parties.",
    "fonctionnement": "Une fois connecté, l'utilisateur peut créer une partie <span class='Important-Word PrimaryColor'>publique</span> ou <span class='Important-Word PrimaryColor'>privée</span>, ajouter des amis et avoir des <span class='Important-Word PrimaryColor'>conversations</span> privées avec eux. Il peut rejoindre une partie en sélectionnant une partie publique affichée dans le salon ou en entrant un <span class='Important-Word PrimaryColor'>code privé</span> pour accéder à une partie spécifique. L’hôte de la partie peut définir le nombre et la <span class='Important-Word PrimaryColor'>configuration</span> des rôles, <span class='Important-Word PrimaryColor'>expulser</span> un joueur et <span class='Important-Word PrimaryColor'>lancer</span> la partie. Les joueurs peuvent discuter dans le salon de la partie, et différents rôles peuvent agir en fonction du <span class='Important-Word PrimaryColor'>tour de jeu.</span> La partie se termine lorsqu'il ne reste que des <span class='Important-Word PrimaryColor'>zombies</span> ou uniquement des <span class='Important-Word PrimaryColor'>humains</span> en vie.",
    "liensExterne": [
    ]
}